# S expression Evaluator

Work in Progress: Right now it is just a calculator with lisp-like (prefix) notation and variables 

# Usage Examples

```
./main
> (+ 1 1)
2
> (setq r 0.05)
0.050000
> (setq P 10000)
10000.000000
> (setq months 24)
24.000000
> (* P (^ (+ 1 (/ r 12)) months))
11049.413356
```

